# Taller

En este taller trabajará con dos dataset  'title.csv' y 'cast.csv'. El archivo 'title.csv' contiene la lista de películas con el año de estreno; mientras que el archivo 'cast.csv' tiene cinco columnas que almacenan el título de la película, año de estreno, elenco de estrellas, tipo (actor / actriz), personajes y calificaciones de los actores, como se muestra a continuación,

In [3]:
#En esta celda se van a dejar  las librerías que usará a lo largo del taller
import pandas as pd

In [6]:
# Cargas los dos datasets
title = pd.read_csv('titles.csv')

In [ ]:
cast   = pd.read_csv('cast.csv')

In [3]:
#Despliegue una muestra del dataset title (head, tail, sample)

In [19]:
title.head()

                                   title  year
0                                 Mahler  1974
1           Ogon, voda i... mednye truby  1968
2  Ana Nojoom bent alasherah wamotalagah  2014
3                      Malu de Bicicleta  2010
4             Nazareno Apostol: Boy Ahas  1989

In [20]:
title.tail()

                       title  year
230402         El lobo negro  1981
230403  Komu na Rusi zhit...  1989
230404              Senotaji  2013
230405     The Leopard Woman  1920
230406    Mio caro assassino  1972

In [9]:
title.sample(10)

                                 title  year
175986                     Final Voice  2016
12690                 Birds of Neptune  2015
224854                          Master  1997
7160                           Victims  2013
10310                 Nadaan Titliyaan  2002
59344     I Was a Teenage TV Terrorist  1985
107488          Xing mu zi gu huo zhao  1979
88523         Ocho apellidos catalanes  2015
79154       Birdemic: Shock and Terror  2010
196375  The Man with Rain in His Shoes  1998

In [17]:
title.describe()

                year
count  230407.000000
mean     1985.810522
std        29.361496
min      1894.000000
25%      1966.000000
50%      1996.000000
75%      2011.000000
max      2024.000000

In [4]:
#Despliegue una muestra del dataset cast  (head, tail, sample)

In [5]:
#Cuantos nomrbes de peliculas hay en title y cuantos son distintos

In [29]:
print(f"Cantidad {len(title.title)}")

Cantidad 230407

In [24]:
title.title.count()

230407

In [15]:
print(f"Distintos {len(title.title.unique())}")

Distintos 210691

In [28]:
#Cuantas peliculas por año en el dataset titles y cuantas en el dataset cast
movies_years = title.groupby(["year"])["title"].count()
movies_years

year
1894        1
1898        1
1899        1
1900        4
1903        1
1905        2
1906        5
1907        4
1908        6
1909       15
1910       22
1911       58
1912      107
1913      246
1914      549
1915      877
1916     1167
1917     1197
1918     1090
1919     1139
1920     1112
1921      968
1922      892
1923      725
1924      799
1925      880
1926      866
1927      869
1928      887
1929      753
        ...
1995     2079
1996     2093
1997     2291
1998     2376
1999     2485
2000     2722
2001     2828
2002     2946
2003     3107
2004     3437
2005     3928
2006     4178
2007     4336
2008     5004
2009     6010
2010     6253
2011     6867
2012     7241
2013     7647
2014     8068
2015     8710
2016    14385
2017     6417
2018     1500
2019      286
2020      104
2021       15
2022       12
2023       10
2024        1
Name: title, Length: 125, dtype: int64

In [7]:
# cuantas peliculas tienen por nombre "Hamlet"

In [8]:
#Cuantas peliculas son de nombre "Carmen" y son de antes de 1950

In [9]:
# Titulos mas comunes en la historia filmografica

In [10]:
# Cual fue la primer pelicula hecha titulada "Romeo and Juliet"

In [11]:
# Listar todas las peliculas que contengan la palabra "Exorcist" 
# ordenadas de la mas antigua a la mas reciente

In [12]:
# Cuantas peliculas fueron hechas en el año 1950?

In [13]:
# Cuantas peliculas fueron despues del año 1970?

In [14]:
# Cuantas peliculas fueron hechas de 1970 a 1979

Ahora se trabajara con el dataset de cast, importante tambien tener en cuneta que e sun dataset que se tendra que limpiar con el paso de las clases y dejarlo lo mas optimo posible

In [15]:
# Cuantos roles o papeles hubo en la pelicula "The Godfather"

#Doy la solución a este punto para que vean que es lo que se pide

len(cast.loc[cas.title == "The Godfather"])

NameError: name 'cast' is not defined

In [ ]:
# Cuantos papeles en la pelicula "The Godfather" no estan clasificados en algun valor "n"

In [ ]:
# Cuantos papeles en la pelicula "The Godfather" si estuvieron clasificados con un valor "n"

In [ ]:
# Mostrar el elenco completo de la pelicula "2001: A Space Odyssey" 
# ordenado por su clasificasión "n", ignorando los papeles que no se les asigno ningun valor "n"

In [ ]:
# Mostrar el elenco completo ordenado por la clasificacion "n"
# de la pelicula "Dracula" de 1958

In [ ]:
# Cuantos papeles de "Bruce Wayne" han sido hechos en la historia  de las peliculas (papeles hace referencia a la coulumna character)